name: "AT7NHPBHPR"
input: "data"
input_shape {
  dim: 160
  dim: 3
  dim: 209
  dim: 128
}
input: "ground_truth"
input_shape {
  dim: 160
  dim: 1
  dim: 208
  dim: 128
}
input: "rec_input_1"
input_shape {
  dim: 5
  dim: 2
  dim: 208
  dim: 128
}
input: "rec_input_2"
input_shape {
  dim: 5
  dim: 20
  dim: 53
  dim: 33
}
input: "rec_input_3"
input_shape {
  dim: 5
  dim: 20
  dim: 53
  dim: 33
}
layer {
  name : "data_slice"
  bottom : "data"
  top : "data_0000"
  top : "data_0001"
  top : "data_0002"
  top : "data_0003"
  top : "data_0004"
  top : "data_0005"
  top : "data_0006"
  top : "data_0007"
  top : "data_0008"
  top : "data_0009"
  top : "data_0010"
  top : "data_0011"
  top : "data_0012"
  top : "data_0013"
  top : "data_0014"
  top : "data_0015"
  top : "data_0016"
  top : "data_0017"
  top : "data_0018"
  top : "data_0019"
  top : "data_0020"
  top : "data_0021"
  top : "data_0022"
  top : "data_0023"
  top : "data_0024"
  top : "data_0025"
  top : "data_0026"
  top : "data_0027"
  top : "data_0028"
  top : "data_0029"
  top : "data_0030"
  top : "data_0031"
  slice_param {
    slice_dim : 0
    slice_point : 5
    slice_point : 10
    slice_point : 15
    slice_point : 20
    slice_point : 25
    slice_point : 30
    slice_point : 35
    slice_point : 40
    slice_point : 45
    slice_point : 50
    slice_point : 55
    slice_point : 60
    slice_point : 65
    slice_point : 70
    slice_point : 75
    slice_point : 80
    slice_point : 85
    slice_point : 90
    slice_point : 95
    slice_point : 100
    slice_point : 105
    slice_point : 110
    slice_point : 115
    slice_point : 120
    slice_point : 125
    slice_point : 130
    slice_point : 135
    slice_point : 140
    slice_point : 145
    slice_point : 150
    slice_point : 155
  }
  type : "Slice"

}
layer {
  name : "ground_truth_slice"
  bottom : "ground_truth"
  top : "ground_truth_0000"
  top : "ground_truth_0001"
  top : "ground_truth_0002"
  top : "ground_truth_0003"
  top : "ground_truth_0004"
  top : "ground_truth_0005"
  top : "ground_truth_0006"
  top : "ground_truth_0007"
  top : "ground_truth_0008"
  top : "ground_truth_0009"
  top : "ground_truth_0010"
  top : "ground_truth_0011"
  top : "ground_truth_0012"
  top : "ground_truth_0013"
  top : "ground_truth_0014"
  top : "ground_truth_0015"
  top : "ground_truth_0016"
  top : "ground_truth_0017"
  top : "ground_truth_0018"
  top : "ground_truth_0019"
  top : "ground_truth_0020"
  top : "ground_truth_0021"
  top : "ground_truth_0022"
  top : "ground_truth_0023"
  top : "ground_truth_0024"
  top : "ground_truth_0025"
  top : "ground_truth_0026"
  top : "ground_truth_0027"
  top : "ground_truth_0028"
  top : "ground_truth_0029"
  top : "ground_truth_0030"
  top : "ground_truth_0031"
  slice_param {
    slice_dim : 0
    slice_point : 5
    slice_point : 10
    slice_point : 15
    slice_point : 20
    slice_point : 25
    slice_point : 30
    slice_point : 35
    slice_point : 40
    slice_point : 45
    slice_point : 50
    slice_point : 55
    slice_point : 60
    slice_point : 65
    slice_point : 70
    slice_point : 75
    slice_point : 80
    slice_point : 85
    slice_point : 90
    slice_point : 95
    slice_point : 100
    slice_point : 105
    slice_point : 110
    slice_point : 115
    slice_point : 120
    slice_point : 125
    slice_point : 130
    slice_point : 135
    slice_point : 140
    slice_point : 145
    slice_point : 150
    slice_point : 155
  }
  type : "Slice"

}
layer {
  name : "conv1"
  bottom : "data_0000"
  top : "conv1_0000"
  param {
    lr_mult : 1
    name : "conv1_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv1_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    stride : 1
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu1"
  bottom : "conv1_0000"
  top : "conv1_0000"
  param {
    lr_mult : 1
    name : "relu1"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool1"
  bottom : "conv1_0000"
  top : "pool1_0000"
  type : "Pooling"

}
layer {
  name : "conv2"
  bottom : "pool1_0000"
  top : "conv2_0000"
  param {
    lr_mult : 1
    name : "conv2_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv2_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu2"
  bottom : "conv2_0000"
  top : "conv2_0000"
  param {
    lr_mult : 1
    name : "relu2"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool2"
  bottom : "conv2_0000"
  top : "pool2_0000"
  type : "Pooling"

}
layer {
  name : "conv3"
  bottom : "pool2_0000"
  top : "conv3_0000"
  param {
    lr_mult : 1
    name : "conv3_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv3_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu3"
  bottom : "conv3_0000"
  top : "conv3_0000"
  param {
    lr_mult : 1
    name : "relu3"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool3"
  bottom : "conv3_0000"
  top : "pool3_0000"
  type : "Pooling"

}
layer {
  name : "conv4"
  bottom : "pool3_0000"
  top : "conv4_0000"
  param {
    lr_mult : 1
    name : "conv4_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv4_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu4"
  bottom : "conv4_0000"
  top : "conv4_0000"
  param {
    lr_mult : 1
    name : "reul4"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool4"
  bottom : "conv4_0000"
  top : "pool4_0000"
  type : "Pooling"

}
layer {
  name : "conv5"
  bottom : "pool4_0000"
  top : "conv5_0000"
  param {
    lr_mult : 1
    name : "conv5_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv5_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 8
    kernel_size : 17
  }
  type : "Convolution"

}
layer {
  name : "relu5"
  bottom : "conv5_0000"
  top : "conv5_0000"
  param {
    lr_mult : 1
    name : "relu5"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 8
    pool : MAX
    kernel_size : 17
  }
  name : "pool5"
  bottom : "conv5_0000"
  top : "pool5_0000"
  type : "Pooling"

}
layer {
  name : "rec_conv1"
  bottom : "rec_input_1"
  top : "rec_conv1_0000"
  param {
    lr_mult : 1
    name : "rec_conv1_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv1_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    stride : 1
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu1"
  bottom : "rec_conv1_0000"
  top : "rec_conv1_0000"
  param {
    lr_mult : 1
    name : "rec_relu1"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool1"
  bottom : "rec_conv1_0000"
  top : "rec_pool1_0000"
  type : "Pooling"

}
layer {
  name : "rec_conv2"
  bottom : "rec_pool1_0000"
  top : "rec_conv2_0000"
  param {
    lr_mult : 1
    name : "rec_conv2_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv2_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu2"
  bottom : "rec_conv2_0000"
  top : "rec_conv2_0000"
  param {
    lr_mult : 1
    name : "rec_relu2"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool2"
  bottom : "rec_conv2_0000"
  top : "rec_pool2_0000"
  type : "Pooling"

}
layer {
  name : "rec_conv3"
  bottom : "rec_pool2_0000"
  top : "rec_conv3_0000"
  param {
    lr_mult : 1
    name : "rec_conv3_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv3_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu3"
  bottom : "rec_conv3_0000"
  top : "rec_conv3_0000"
  param {
    lr_mult : 1
    name : "rec_relu3"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool3"
  bottom : "rec_conv3_0000"
  top : "rec_pool3_0000"
  type : "Pooling"

}
layer {
  name : "lstm1_inp_concat"
  bottom : "pool5_0000"
  bottom : "rec_pool3_0000"
  bottom : "rec_input_3"
  top : "lstm1_inp_concat_0000"
  type : "Concat"

}
layer {
  name : "lstm1_block"
  bottom : "lstm1_inp_concat_0000"
  top : "lstm1_block_0000"
  param {
    lr_mult : 1
    name : "lstm1_convBLOCK_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convBLOCK_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_block_tanh"
  bottom : "lstm1_block_0000"
  top : "lstm1_block_0000"
  type : "TanH"

}
layer {
  name : "lstm1_inpcell_concat"
  bottom : "lstm1_inp_concat_0000"
  bottom : "rec_input_2"
  top : "lstm1_inpcell_concat_0000"
  type : "Concat"

}
layer {
  name : "lstm1_input"
  bottom : "lstm1_inpcell_concat_0000"
  top : "lstm1_input_0000"
  param {
    lr_mult : 1
    name : "lstm1_convINPUT_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convINPUT_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_input_sig"
  bottom : "lstm1_input_0000"
  top : "lstm1_input_0000"
  type : "Sigmoid"

}
layer {
  name : "lstm1_block_input_mult"
  bottom : "lstm1_block_0000"
  bottom : "lstm1_input_0000"
  top : "lstm1_block_input_mult_0000"
  type : "Eltwise"
  eltwise_param {
    operation : PROD
  }

}
layer {
  name : "lstm1_forget"
  bottom : "lstm1_inpcell_concat_0000"
  top : "lstm1_forget_0000"
  param {
    lr_mult : 1
    name : "lstm1_convFORGET_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convFORGET_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_forget_sig"
  bottom : "lstm1_forget_0000"
  top : "lstm1_forget_0000"
  type : "Sigmoid"

}
layer {
  name : "lstm1_cell_forget_mult"
  bottom : "lstm1_forget_0000"
  bottom : "rec_input_2"
  top : "lstm1_cell_forget_mult_0000"
  type : "Eltwise"
  eltwise_param {
    operation : PROD
  }

}
layer {
  name : "lstm1_cell"
  bottom : "lstm1_block_input_mult_0000"
  bottom : "lstm1_cell_forget_mult_0000"
  top : "rec_output_2_0000"
  type : "Eltwise"
  eltwise_param {
    operation : SUM
  }

}
layer {
  name : "lstm1_cell_tanh"
  bottom : "rec_output_2_0000"
  top : "lstm1_cell_tanh_0000"
  type : "TanH"

}
layer {
  name : "lstm1_inpnewcell_concat"
  bottom : "lstm1_inp_concat_0000"
  bottom : "rec_output_2_0000"
  top : "lstm1_inpnewcell_concat_0000"
  type : "Concat"

}
layer {
  name : "lstm1_output"
  bottom : "lstm1_inpnewcell_concat_0000"
  top : "lstm1_output_0000"
  param {
    lr_mult : 1
    name : "lstm1_convOUTPUT_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convOUTPUT_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_output_sig"
  bottom : "lstm1_output_0000"
  top : "lstm1_output_0000"
  type : "Sigmoid"

}
layer {
  name : "lstm1_output_cell_mult"
  bottom : "lstm1_output_0000"
  bottom : "lstm1_cell_tanh_0000"
  top : "rec_output_3_0000"
  type : "Eltwise"
  eltwise_param {
    operation : PROD
  }

}
layer {
  name : "fc_conv2"
  bottom : "rec_output_3_0000"
  top : "fc_conv2_0000"
  param {
    lr_mult : 1
    name : "fc_conv2_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "fc_conv2_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 1
    kernel_size : 3
  }
  type : "Convolution"

}
layer {
  name : "fc_drop2"
  bottom : "fc_conv2_0000"
  top : "fc_conv2_0000"
  dropout_param {
    dropout_ratio : 0.1
  }
  type : "Dropout"

}
layer {
  name : "fc_relu2"
  bottom : "fc_conv2_0000"
  top : "fc_conv2_0000"
  param {
    lr_mult : 1
    name : "fc_relu2"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  name : "deconv"
  bottom : "fc_conv2_0000"
  top : "output_0000"
  param {
    lr_mult : 1
    name : "deconv_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "deconv_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    stride : 4
    num_output : 2
    weight_filler {
      type : "prelu"
    }
    pad : 8
    kernel_size : 16
  }
  type : "Deconvolution"

}
layer {
  name : "rec_output_1"
  bottom : "output_0000"
  top : "rec_output_1_0000"
  type : "Split"

}
layer {
  name : "conv1_0001"
  bottom : "data_0001"
  top : "conv1_0001"
  param {
    lr_mult : 1
    name : "conv1_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv1_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    stride : 1
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu1_0001"
  bottom : "conv1_0001"
  top : "conv1_0001"
  param {
    lr_mult : 1
    name : "relu1"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool1_0001"
  bottom : "conv1_0001"
  top : "pool1_0001"
  type : "Pooling"

}
layer {
  name : "conv2_0001"
  bottom : "pool1_0001"
  top : "conv2_0001"
  param {
    lr_mult : 1
    name : "conv2_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv2_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu2_0001"
  bottom : "conv2_0001"
  top : "conv2_0001"
  param {
    lr_mult : 1
    name : "relu2"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool2_0001"
  bottom : "conv2_0001"
  top : "pool2_0001"
  type : "Pooling"

}
layer {
  name : "conv3_0001"
  bottom : "pool2_0001"
  top : "conv3_0001"
  param {
    lr_mult : 1
    name : "conv3_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv3_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu3_0001"
  bottom : "conv3_0001"
  top : "conv3_0001"
  param {
    lr_mult : 1
    name : "relu3"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool3_0001"
  bottom : "conv3_0001"
  top : "pool3_0001"
  type : "Pooling"

}
layer {
  name : "conv4_0001"
  bottom : "pool3_0001"
  top : "conv4_0001"
  param {
    lr_mult : 1
    name : "conv4_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv4_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu4_0001"
  bottom : "conv4_0001"
  top : "conv4_0001"
  param {
    lr_mult : 1
    name : "reul4"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool4_0001"
  bottom : "conv4_0001"
  top : "pool4_0001"
  type : "Pooling"

}
layer {
  name : "conv5_0001"
  bottom : "pool4_0001"
  top : "conv5_0001"
  param {
    lr_mult : 1
    name : "conv5_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv5_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 8
    kernel_size : 17
  }
  type : "Convolution"

}
layer {
  name : "relu5_0001"
  bottom : "conv5_0001"
  top : "conv5_0001"
  param {
    lr_mult : 1
    name : "relu5"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 8
    pool : MAX
    kernel_size : 17
  }
  name : "pool5_0001"
  bottom : "conv5_0001"
  top : "pool5_0001"
  type : "Pooling"

}
layer {
  name : "rec_conv1_0001"
  bottom : "rec_output_1_0000"
  top : "rec_conv1_0001"
  param {
    lr_mult : 1
    name : "rec_conv1_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv1_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    stride : 1
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu1_0001"
  bottom : "rec_conv1_0001"
  top : "rec_conv1_0001"
  param {
    lr_mult : 1
    name : "rec_relu1"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool1_0001"
  bottom : "rec_conv1_0001"
  top : "rec_pool1_0001"
  type : "Pooling"

}
layer {
  name : "rec_conv2_0001"
  bottom : "rec_pool1_0001"
  top : "rec_conv2_0001"
  param {
    lr_mult : 1
    name : "rec_conv2_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv2_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu2_0001"
  bottom : "rec_conv2_0001"
  top : "rec_conv2_0001"
  param {
    lr_mult : 1
    name : "rec_relu2"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool2_0001"
  bottom : "rec_conv2_0001"
  top : "rec_pool2_0001"
  type : "Pooling"

}
layer {
  name : "rec_conv3_0001"
  bottom : "rec_pool2_0001"
  top : "rec_conv3_0001"
  param {
    lr_mult : 1
    name : "rec_conv3_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv3_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu3_0001"
  bottom : "rec_conv3_0001"
  top : "rec_conv3_0001"
  param {
    lr_mult : 1
    name : "rec_relu3"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool3_0001"
  bottom : "rec_conv3_0001"
  top : "rec_pool3_0001"
  type : "Pooling"

}
layer {
  name : "lstm1_inp_concat_0001"
  bottom : "pool5_0001"
  bottom : "rec_pool3_0001"
  bottom : "rec_output_3_0000"
  top : "lstm1_inp_concat_0001"
  type : "Concat"

}
layer {
  name : "lstm1_block_0001"
  bottom : "lstm1_inp_concat_0001"
  top : "lstm1_block_0001"
  param {
    lr_mult : 1
    name : "lstm1_convBLOCK_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convBLOCK_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_block_tanh_0001"
  bottom : "lstm1_block_0001"
  top : "lstm1_block_0001"
  type : "TanH"

}
layer {
  name : "lstm1_inpcell_concat_0001"
  bottom : "lstm1_inp_concat_0001"
  bottom : "rec_output_2_0000"
  top : "lstm1_inpcell_concat_0001"
  type : "Concat"

}
layer {
  name : "lstm1_input_0001"
  bottom : "lstm1_inpcell_concat_0001"
  top : "lstm1_input_0001"
  param {
    lr_mult : 1
    name : "lstm1_convINPUT_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convINPUT_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_input_sig_0001"
  bottom : "lstm1_input_0001"
  top : "lstm1_input_0001"
  type : "Sigmoid"

}
layer {
  name : "lstm1_block_input_mult_0001"
  bottom : "lstm1_block_0001"
  bottom : "lstm1_input_0001"
  top : "lstm1_block_input_mult_0001"
  type : "Eltwise"
  eltwise_param {
    operation : PROD
  }

}
layer {
  name : "lstm1_forget_0001"
  bottom : "lstm1_inpcell_concat_0001"
  top : "lstm1_forget_0001"
  param {
    lr_mult : 1
    name : "lstm1_convFORGET_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convFORGET_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_forget_sig_0001"
  bottom : "lstm1_forget_0001"
  top : "lstm1_forget_0001"
  type : "Sigmoid"

}
layer {
  name : "lstm1_cell_forget_mult_0001"
  bottom : "lstm1_forget_0001"
  bottom : "rec_output_2_0000"
  top : "lstm1_cell_forget_mult_0001"
  type : "Eltwise"
  eltwise_param {
    operation : PROD
  }

}
layer {
  name : "lstm1_cell_0001"
  bottom : "lstm1_block_input_mult_0001"
  bottom : "lstm1_cell_forget_mult_0001"
  top : "rec_output_2_0001"
  type : "Eltwise"
  eltwise_param {
    operation : SUM
  }

}
layer {
  name : "lstm1_cell_tanh_0001"
  bottom : "rec_output_2_0001"
  top : "lstm1_cell_tanh_0001"
  type : "TanH"

}
layer {
  name : "lstm1_inpnewcell_concat_0001"
  bottom : "lstm1_inp_concat_0001"
  bottom : "rec_output_2_0001"
  top : "lstm1_inpnewcell_concat_0001"
  type : "Concat"

}
layer {
  name : "lstm1_output_0001"
  bottom : "lstm1_inpnewcell_concat_0001"
  top : "lstm1_output_0001"
  param {
    lr_mult : 1
    name : "lstm1_convOUTPUT_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convOUTPUT_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_output_sig_0001"
  bottom : "lstm1_output_0001"
  top : "lstm1_output_0001"
  type : "Sigmoid"

}
layer {
  name : "lstm1_output_cell_mult_0001"
  bottom : "lstm1_output_0001"
  bottom : "lstm1_cell_tanh_0001"
  top : "rec_output_3_0001"
  type : "Eltwise"
  eltwise_param {
    operation : PROD
  }

}
layer {
  name : "fc_conv2_0001"
  bottom : "rec_output_3_0001"
  top : "fc_conv2_0001"
  param {
    lr_mult : 1
    name : "fc_conv2_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "fc_conv2_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 1
    kernel_size : 3
  }
  type : "Convolution"

}
layer {
  name : "fc_drop2_0001"
  bottom : "fc_conv2_0001"
  top : "fc_conv2_0001"
  dropout_param {
    dropout_ratio : 0.1
  }
  type : "Dropout"

}
layer {
  name : "fc_relu2_0001"
  bottom : "fc_conv2_0001"
  top : "fc_conv2_0001"
  param {
    lr_mult : 1
    name : "fc_relu2"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  name : "deconv_0001"
  bottom : "fc_conv2_0001"
  top : "output_0001"
  param {
    lr_mult : 1
    name : "deconv_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "deconv_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    stride : 4
    num_output : 2
    weight_filler {
      type : "prelu"
    }
    pad : 8
    kernel_size : 16
  }
  type : "Deconvolution"

}
layer {
  name : "rec_output_1_0001"
  bottom : "output_0001"
  top : "rec_output_1_0001"
  type : "Split"

}
layer {
  name : "conv1_0002"
  bottom : "data_0002"
  top : "conv1_0002"
  param {
    lr_mult : 1
    name : "conv1_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv1_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    stride : 1
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu1_0002"
  bottom : "conv1_0002"
  top : "conv1_0002"
  param {
    lr_mult : 1
    name : "relu1"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool1_0002"
  bottom : "conv1_0002"
  top : "pool1_0002"
  type : "Pooling"

}
layer {
  name : "conv2_0002"
  bottom : "pool1_0002"
  top : "conv2_0002"
  param {
    lr_mult : 1
    name : "conv2_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv2_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu2_0002"
  bottom : "conv2_0002"
  top : "conv2_0002"
  param {
    lr_mult : 1
    name : "relu2"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool2_0002"
  bottom : "conv2_0002"
  top : "pool2_0002"
  type : "Pooling"

}
layer {
  name : "conv3_0002"
  bottom : "pool2_0002"
  top : "conv3_0002"
  param {
    lr_mult : 1
    name : "conv3_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv3_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu3_0002"
  bottom : "conv3_0002"
  top : "conv3_0002"
  param {
    lr_mult : 1
    name : "relu3"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool3_0002"
  bottom : "conv3_0002"
  top : "pool3_0002"
  type : "Pooling"

}
layer {
  name : "conv4_0002"
  bottom : "pool3_0002"
  top : "conv4_0002"
  param {
    lr_mult : 1
    name : "conv4_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv4_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu4_0002"
  bottom : "conv4_0002"
  top : "conv4_0002"
  param {
    lr_mult : 1
    name : "reul4"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool4_0002"
  bottom : "conv4_0002"
  top : "pool4_0002"
  type : "Pooling"

}
layer {
  name : "conv5_0002"
  bottom : "pool4_0002"
  top : "conv5_0002"
  param {
    lr_mult : 1
    name : "conv5_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv5_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 8
    kernel_size : 17
  }
  type : "Convolution"

}
layer {
  name : "relu5_0002"
  bottom : "conv5_0002"
  top : "conv5_0002"
  param {
    lr_mult : 1
    name : "relu5"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 8
    pool : MAX
    kernel_size : 17
  }
  name : "pool5_0002"
  bottom : "conv5_0002"
  top : "pool5_0002"
  type : "Pooling"

}
layer {
  name : "rec_conv1_0002"
  bottom : "rec_output_1_0001"
  top : "rec_conv1_0002"
  param {
    lr_mult : 1
    name : "rec_conv1_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv1_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    stride : 1
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu1_0002"
  bottom : "rec_conv1_0002"
  top : "rec_conv1_0002"
  param {
    lr_mult : 1
    name : "rec_relu1"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool1_0002"
  bottom : "rec_conv1_0002"
  top : "rec_pool1_0002"
  type : "Pooling"

}
layer {
  name : "rec_conv2_0002"
  bottom : "rec_pool1_0002"
  top : "rec_conv2_0002"
  param {
    lr_mult : 1
    name : "rec_conv2_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv2_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu2_0002"
  bottom : "rec_conv2_0002"
  top : "rec_conv2_0002"
  param {
    lr_mult : 1
    name : "rec_relu2"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool2_0002"
  bottom : "rec_conv2_0002"
  top : "rec_pool2_0002"
  type : "Pooling"

}
layer {
  name : "rec_conv3_0002"
  bottom : "rec_pool2_0002"
  top : "rec_conv3_0002"
  param {
    lr_mult : 1
    name : "rec_conv3_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv3_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu3_0002"
  bottom : "rec_conv3_0002"
  top : "rec_conv3_0002"
  param {
    lr_mult : 1
    name : "rec_relu3"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool3_0002"
  bottom : "rec_conv3_0002"
  top : "rec_pool3_0002"
  type : "Pooling"

}
layer {
  name : "lstm1_inp_concat_0002"
  bottom : "pool5_0002"
  bottom : "rec_pool3_0002"
  bottom : "rec_output_3_0001"
  top : "lstm1_inp_concat_0002"
  type : "Concat"

}
layer {
  name : "lstm1_block_0002"
  bottom : "lstm1_inp_concat_0002"
  top : "lstm1_block_0002"
  param {
    lr_mult : 1
    name : "lstm1_convBLOCK_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convBLOCK_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_block_tanh_0002"
  bottom : "lstm1_block_0002"
  top : "lstm1_block_0002"
  type : "TanH"

}
layer {
  name : "lstm1_inpcell_concat_0002"
  bottom : "lstm1_inp_concat_0002"
  bottom : "rec_output_2_0001"
  top : "lstm1_inpcell_concat_0002"
  type : "Concat"

}
layer {
  name : "lstm1_input_0002"
  bottom : "lstm1_inpcell_concat_0002"
  top : "lstm1_input_0002"
  param {
    lr_mult : 1
    name : "lstm1_convINPUT_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convINPUT_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_input_sig_0002"
  bottom : "lstm1_input_0002"
  top : "lstm1_input_0002"
  type : "Sigmoid"

}
layer {
  name : "lstm1_block_input_mult_0002"
  bottom : "lstm1_block_0002"
  bottom : "lstm1_input_0002"
  top : "lstm1_block_input_mult_0002"
  type : "Eltwise"
  eltwise_param {
    operation : PROD
  }

}
layer {
  name : "lstm1_forget_0002"
  bottom : "lstm1_inpcell_concat_0002"
  top : "lstm1_forget_0002"
  param {
    lr_mult : 1
    name : "lstm1_convFORGET_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convFORGET_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_forget_sig_0002"
  bottom : "lstm1_forget_0002"
  top : "lstm1_forget_0002"
  type : "Sigmoid"

}
layer {
  name : "lstm1_cell_forget_mult_0002"
  bottom : "lstm1_forget_0002"
  bottom : "rec_output_2_0001"
  top : "lstm1_cell_forget_mult_0002"
  type : "Eltwise"
  eltwise_param {
    operation : PROD
  }

}
layer {
  name : "lstm1_cell_0002"
  bottom : "lstm1_block_input_mult_0002"
  bottom : "lstm1_cell_forget_mult_0002"
  top : "rec_output_2_0002"
  type : "Eltwise"
  eltwise_param {
    operation : SUM
  }

}
layer {
  name : "lstm1_cell_tanh_0002"
  bottom : "rec_output_2_0002"
  top : "lstm1_cell_tanh_0002"
  type : "TanH"

}
layer {
  name : "lstm1_inpnewcell_concat_0002"
  bottom : "lstm1_inp_concat_0002"
  bottom : "rec_output_2_0002"
  top : "lstm1_inpnewcell_concat_0002"
  type : "Concat"

}
layer {
  name : "lstm1_output_0002"
  bottom : "lstm1_inpnewcell_concat_0002"
  top : "lstm1_output_0002"
  param {
    lr_mult : 1
    name : "lstm1_convOUTPUT_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convOUTPUT_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_output_sig_0002"
  bottom : "lstm1_output_0002"
  top : "lstm1_output_0002"
  type : "Sigmoid"

}
layer {
  name : "lstm1_output_cell_mult_0002"
  bottom : "lstm1_output_0002"
  bottom : "lstm1_cell_tanh_0002"
  top : "rec_output_3_0002"
  type : "Eltwise"
  eltwise_param {
    operation : PROD
  }

}
layer {
  name : "fc_conv2_0002"
  bottom : "rec_output_3_0002"
  top : "fc_conv2_0002"
  param {
    lr_mult : 1
    name : "fc_conv2_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "fc_conv2_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 1
    kernel_size : 3
  }
  type : "Convolution"

}
layer {
  name : "fc_drop2_0002"
  bottom : "fc_conv2_0002"
  top : "fc_conv2_0002"
  dropout_param {
    dropout_ratio : 0.1
  }
  type : "Dropout"

}
layer {
  name : "fc_relu2_0002"
  bottom : "fc_conv2_0002"
  top : "fc_conv2_0002"
  param {
    lr_mult : 1
    name : "fc_relu2"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  name : "deconv_0002"
  bottom : "fc_conv2_0002"
  top : "output_0002"
  param {
    lr_mult : 1
    name : "deconv_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "deconv_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    stride : 4
    num_output : 2
    weight_filler {
      type : "prelu"
    }
    pad : 8
    kernel_size : 16
  }
  type : "Deconvolution"

}
layer {
  name : "rec_output_1_0002"
  bottom : "output_0002"
  top : "rec_output_1_0002"
  type : "Split"

}
layer {
  name : "conv1_0003"
  bottom : "data_0003"
  top : "conv1_0003"
  param {
    lr_mult : 1
    name : "conv1_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv1_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    stride : 1
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu1_0003"
  bottom : "conv1_0003"
  top : "conv1_0003"
  param {
    lr_mult : 1
    name : "relu1"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool1_0003"
  bottom : "conv1_0003"
  top : "pool1_0003"
  type : "Pooling"

}
layer {
  name : "conv2_0003"
  bottom : "pool1_0003"
  top : "conv2_0003"
  param {
    lr_mult : 1
    name : "conv2_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv2_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu2_0003"
  bottom : "conv2_0003"
  top : "conv2_0003"
  param {
    lr_mult : 1
    name : "relu2"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool2_0003"
  bottom : "conv2_0003"
  top : "pool2_0003"
  type : "Pooling"

}
layer {
  name : "conv3_0003"
  bottom : "pool2_0003"
  top : "conv3_0003"
  param {
    lr_mult : 1
    name : "conv3_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv3_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu3_0003"
  bottom : "conv3_0003"
  top : "conv3_0003"
  param {
    lr_mult : 1
    name : "relu3"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool3_0003"
  bottom : "conv3_0003"
  top : "pool3_0003"
  type : "Pooling"

}
layer {
  name : "conv4_0003"
  bottom : "pool3_0003"
  top : "conv4_0003"
  param {
    lr_mult : 1
    name : "conv4_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv4_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "relu4_0003"
  bottom : "conv4_0003"
  top : "conv4_0003"
  param {
    lr_mult : 1
    name : "reul4"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "pool4_0003"
  bottom : "conv4_0003"
  top : "pool4_0003"
  type : "Pooling"

}
layer {
  name : "conv5_0003"
  bottom : "pool4_0003"
  top : "conv5_0003"
  param {
    lr_mult : 1
    name : "conv5_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "conv5_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 32
    weight_filler {
      type : "prelu"
    }
    pad : 8
    kernel_size : 17
  }
  type : "Convolution"

}
layer {
  name : "relu5_0003"
  bottom : "conv5_0003"
  top : "conv5_0003"
  param {
    lr_mult : 1
    name : "relu5"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 8
    pool : MAX
    kernel_size : 17
  }
  name : "pool5_0003"
  bottom : "conv5_0003"
  top : "pool5_0003"
  type : "Pooling"

}
layer {
  name : "rec_conv1_0003"
  bottom : "rec_output_1_0002"
  top : "rec_conv1_0003"
  param {
    lr_mult : 1
    name : "rec_conv1_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv1_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    stride : 1
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu1_0003"
  bottom : "rec_conv1_0003"
  top : "rec_conv1_0003"
  param {
    lr_mult : 1
    name : "rec_relu1"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool1_0003"
  bottom : "rec_conv1_0003"
  top : "rec_pool1_0003"
  type : "Pooling"

}
layer {
  name : "rec_conv2_0003"
  bottom : "rec_pool1_0003"
  top : "rec_conv2_0003"
  param {
    lr_mult : 1
    name : "rec_conv2_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv2_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu2_0003"
  bottom : "rec_conv2_0003"
  top : "rec_conv2_0003"
  param {
    lr_mult : 1
    name : "rec_relu2"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 2
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool2_0003"
  bottom : "rec_conv2_0003"
  top : "rec_pool2_0003"
  type : "Pooling"

}
layer {
  name : "rec_conv3_0003"
  bottom : "rec_pool2_0003"
  top : "rec_conv3_0003"
  param {
    lr_mult : 1
    name : "rec_conv3_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "rec_conv3_b"
    decay_mult : 0
  }
  convolution_param {
    bias_filler {
      type : "constant"
      value : 0
    }
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    pad : 2
    kernel_size : 5
  }
  type : "Convolution"

}
layer {
  name : "rec_relu3_0003"
  bottom : "rec_conv3_0003"
  top : "rec_conv3_0003"
  param {
    lr_mult : 1
    name : "rec_relu3"
  }
  prelu_param {
    filler {
      type : "constant"
      value : 0.25
    }
  }
  type : "PReLU"

}
layer {
  pooling_param {
    stride : 1
    pad : 2
    pool : MAX
    kernel_size : 5
  }
  name : "rec_pool3_0003"
  bottom : "rec_conv3_0003"
  top : "rec_pool3_0003"
  type : "Pooling"

}
layer {
  name : "lstm1_inp_concat_0003"
  bottom : "pool5_0003"
  bottom : "rec_pool3_0003"
  bottom : "rec_output_3_0002"
  top : "lstm1_inp_concat_0003"
  type : "Concat"

}
layer {
  name : "lstm1_block_0003"
  bottom : "lstm1_inp_concat_0003"
  top : "lstm1_block_0003"
  param {
    lr_mult : 1
    name : "lstm1_convBLOCK_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convBLOCK_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_block_tanh_0003"
  bottom : "lstm1_block_0003"
  top : "lstm1_block_0003"
  type : "TanH"

}
layer {
  name : "lstm1_inpcell_concat_0003"
  bottom : "lstm1_inp_concat_0003"
  bottom : "rec_output_2_0002"
  top : "lstm1_inpcell_concat_0003"
  type : "Concat"

}
layer {
  name : "lstm1_input_0003"
  bottom : "lstm1_inpcell_concat_0003"
  top : "lstm1_input_0003"
  param {
    lr_mult : 1
    name : "lstm1_convINPUT_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convINPUT_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_input_sig_0003"
  bottom : "lstm1_input_0003"
  top : "lstm1_input_0003"
  type : "Sigmoid"

}
layer {
  name : "lstm1_block_input_mult_0003"
  bottom : "lstm1_block_0003"
  bottom : "lstm1_input_0003"
  top : "lstm1_block_input_mult_0003"
  type : "Eltwise"
  eltwise_param {
    operation : PROD
  }

}
layer {
  name : "lstm1_forget_0003"
  bottom : "lstm1_inpcell_concat_0003"
  top : "lstm1_forget_0003"
  param {
    lr_mult : 1
    name : "lstm1_convFORGET_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convFORGET_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_forget_sig_0003"
  bottom : "lstm1_forget_0003"
  top : "lstm1_forget_0003"
  type : "Sigmoid"

}
layer {
  name : "lstm1_cell_forget_mult_0003"
  bottom : "lstm1_forget_0003"
  bottom : "rec_output_2_0002"
  top : "lstm1_cell_forget_mult_0003"
  type : "Eltwise"
  eltwise_param {
    operation : PROD
  }

}
layer {
  name : "lstm1_cell_0003"
  bottom : "lstm1_block_input_mult_0003"
  bottom : "lstm1_cell_forget_mult_0003"
  top : "rec_output_2_0003"
  type : "Eltwise"
  eltwise_param {
    operation : SUM
  }

}
layer {
  name : "lstm1_cell_tanh_0003"
  bottom : "rec_output_2_0003"
  top : "lstm1_cell_tanh_0003"
  type : "TanH"

}
layer {
  name : "lstm1_inpnewcell_concat_0003"
  bottom : "lstm1_inp_concat_0003"
  bottom : "rec_output_2_0003"
  top : "lstm1_inpnewcell_concat_0003"
  type : "Concat"

}
layer {
  name : "lstm1_output_0003"
  bottom : "lstm1_inpnewcell_concat_0003"
  top : "lstm1_output_0003"
  param {
    lr_mult : 1
    name : "lstm1_convOUTPUT_w"
    decay_mult : 1
  }
  param {
    lr_mult : 2
    name : "lstm1_convOUTPUT_b"
    decay_mult : 0
  }
  convolution_param {
    num_output : 20
    weight_filler {
      type : "prelu"
    }
    bias_filler {
      type : "constant"
      value : 0
    }
    kernel_size : 1
  }
  type : "Convolution"

}
layer {
  name : "lstm1_output_sig_0003"
  bottom : "lstm1_output_0003"
